'use strict';

// Пусть у нашего робота будет массив всех разрешенных городов. Когда человек будет вбивать в инпут свой город, робот должен будет проверять наличие этого города в своем массиве.
// В таком случае в каждом ходе игрока возможны следующие проблемные ситуации: игрок ввел город, который уже был; игрок ввел город не на ту букву, на которую заканчивается предыдущий город; игрок ввел город, которого нет в списке робота.
// В свой ход робот должен брать один из разрешенных городов так, чтобы этого города еще не было в игре. При этом выбранный город должен начинаться с буквы, на которую закончился предыдущий город.
// №1 ⊗jsPrGCtAR


let field   = document.querySelector('#field');
let message = document.querySelector('#message');

let allCities = ["Абакан", "Азов", "Александров", "Алексин", 'Альметьевск', 'Анапа', 'Ангарск', 'Анжеро-Судженск', 'Апатиты', 'Арзамас', 'Армавир', 'Арсеньев', 'Артем', 'Архангельск', 'Асбест', 'Астрахань', 'Ачинск', 'Балаково', 'Балахна', 'Балашиха', 'Балашов', 'Барнаул', 'Батайск', 'Белгород', 'Белебей', 'Белово', 'Белогорск', 'Белорецк', 'Белореченск', 'Бердск', 'Березники', 'Березовский', 'Бийск', 'Биробиджан', 'Благовещенск', 'Бор', 'Борисоглебск', 'Боровичи', 'Братск', 'Брянск', 'Бугульма', 'Буденновск', 'Бузулук', 'Буйнакск', 'Великие Луки', 'Великий Новгород', 'Верхняя Пышма', 'Видное', 'Владивосток', 'Владикавказ', 'Владимир', 'Волгоград', 'Волгодонск', 'Волжск', 'Волжский', 'Вологда', 'Вольск', 'Воркута', 'Воронеж', 'Воскресенск', 'Воткинск', 'Всеволожск', 'Выборг', 'Выкса', 'Вязьма', 'Гатчина', 'Геленджик', 'Георгиевск', 'Глазов', 'Горно-Алтайск', 'Грозный', 'Губкин', 'Гудермес', 'Гуково', 'Гусь-Хрустальный', 'Дербент', 'Дзержинск', 'Димитровград', 'Дмитров', 'Долгопрудный', 'Домодедово', 'Донской', 'Дубна', 'Евпатория', 'Егорьевск', 'Ейск', 'Екатеринбург', 'Елабуга', 'Елец', 'Ессентуки', 'Ефремов', 'Железногорск', 'Жигулевск', 'Жуков', 'Жуковский', 'Заречный', 'Зеленогорск', 'Зеленодольск', 'Златоуст',"Иваново", "Ивантеевка", "Ижевск", "Избербаш", "Иркутск", "Искитим", "Ишим", "Ишимбай", "Йошкар-Ола", "Казань", "Калининград", "Калуга", "Каменск-Уральский", "Каменск-Шахтинский", "Камышин", "Канск", "Каспийск", "Кемерово", "Керчь", "Кинешма", "Кириши", "Киров", "Кирово-Чепецк", "Киселевск", "Кисловодск", "Клин", "Клинцы", "Ковров",  "Когалым", "Коломна", "Комсомольск-на-Амуре", "Копейск", "Королев", "Кострома", "Котлас", "Красногорск", "Краснодар",  "Краснокаменск", "Краснокамск", "Краснотурьинск", "Красноярск", "Кропоткин", "Крымск", "Кстово", "Кузнецк", 
"Кумертау", "Кунгур", "Курган", "Курск", "Кызыл", "Лабинск", "Лениногорск", "Ленинск-Кузнецкий", "Лесосибирск", "Липецк", "Лиски",  "Лобня", "Лысьва",  "Лыткарино", "Люберцы", "Магадан",  "Магнитогорск",  "Майкоп", "Махачкала",  "Междуреченск", "Мелеуз", "Миасс", "Минеральные Воды", "Минусинск", "Михайловка",  "Михайловск", "Мичуринск", "Москва", "Мурманск", "Муром", "Мытищи",  "Набережные Челны", "Назарово", "Назрань", "Нальчик", "Наро-Фоминск", "Находка", "Невинномысск", "Нерюнгри", "Нефтекамск", "Нефтеюганск",  "Нижневартовск", "Нижнекамск", "Нижний Новгород", "Нижний Тагил", "Новоалтайск",  "Новокузнецк", "Новокуйбышевск", "Новомосковск",  "Новороссийск", "Новосибирск", "Новотроицк", "Новоуральск", "Новочебоксарск", "Новочеркасск", "Новошахтинск", "Новый Уренгой", "Ногинск", "Норильск", "Ноябрьск", "Нягань", "Обнинск", "Одинцово", "Озерск", "Октябрьский", "Омск", "Орел", "Оренбург", "Орехово-Зуево", "Орск", "Павлово", "Павловский Посад", "Пенза", "Первоуральск", "Пермь", "Петрозаводск", "Петропавловск-Камчатский", "Подольск", "Полевской", "Прокопьевск", "Протвино", "Прохладный", "Псков", "Пушкино", "Пятигорск", "Раменское", "Ревда", "Реутов", "Ржев", "Рославль", "Россошь", "Ростов-на-Дону", "Рубцовск", "Рыбинск", "Рязань", "Салават", "Сальск", "Самара", "Санкт-Петербург", "Саранск", "Сарапул", "Саратов", "Саров", "Свободный", "Севастополь", "Северодвинск", "Северск", "Сергиев Посад", "Серов", "Серпухов", "Сертолово", "Сибай", "Симферополь", "Славянск-на-Кубани", "Смоленск", "Соликамск", "Солнечногорск", "Сосновый Бор", "Сочи", "Ставрополь", "Старый Оскол", "Стерлитамак", "Ступино", "Сургут", "Сызрань", "Сыктывкар", "Таганрог", "Тамбов", "Тверь", "Тимашевск", "Тихвин", "Тихорецк", "Тобольск", "Тольятти", "Томск", "Троицк", "Туапсе", "Туймазы", "Тула", "Тюмень", "Узловая", "Улан-Удэ", "Ульяновск", "Урус-Мартан", "Усолье-Сибирское", "Уссурийск", "Усть-Илимск", "Уфа", "Ухта", "Феодосия", "Фрязино", "Хабаровск", "Ханты-Мансийск", "Хасавюрт", "Химки", "Чайковский", "Чапаевск", "Чебоксары", "Челябинск", "Черемхово", "Череповец", "Черкесск", "Черногорск", "Чехов", "Чистополь", "Чита", "Шадринск", "Шали", "Шахты", "Шуя", "Щекино", "Щелково", "Электросталь", "Элиста", "Энгельс", "Южно-Сахалинск", "Юрга", "Якутск", "Ялта", "Ярославль"];

let cities = [];
let prohibitedChars = ['ы', 'ъ', 'ь'];

field.addEventListener('keydown', function(event) {
    if(event.key === 'Enter') {
        let value = field.value.toLowerCase().trim();
        if(!checkAllCities(value)) {
            message.textContent = 'Этого города не существует в базе городов. Напишите другой город';
            field.value = '';
        } else if(cities.length === 0 && checkAllCities(value)) {
            cities.push(value);
            message.textContent = 'Верно! Следующий игрок';
            field.value = '';
        } else if(cities.length !== 0 && checkAllCities(value)) {
            checkAll(value, cities);
        }
    }
});

function checkAllCities(city) { // проверка на то, что город существует в списке робота
    return allCities.find(item => item.trim().toLowerCase() === city.trim().toLowerCase());
}

function checkCity(city, arr) { // проверка на то, что город уже был назван
    return arr.find(item => item === city.trim().toLowerCase());
}

function compareLetters(city, arr) {
    let fierstLetter = city.toLowerCase().trim().slice(0, 1);
    console.log('fierstLetter: ' + fierstLetter);

    let lastLatter = arr[arr.length - 1].slice(-1).toLowerCase();
    console.log('lastLatter1: ' + lastLatter);

    for(let char of prohibitedChars) {
        if(lastLatter === char) {
            lastLatter = arr[arr.length - 1].slice(-2, -1).toLowerCase();
            console.log('lastLatter2: ' + lastLatter);
        }
    }

    if(fierstLetter !== lastLatter) {
        return false;
    }
    return true;
}

function checkAll(city, arr) {
    if(compareLetters(city, arr) && !checkCity(city, arr)) {
        cities.push(city);
        message.textContent = 'Верно! Следующий игрок';
        field.value = '';
    } else if(compareLetters(city, arr) && checkCity(city, arr)) {
        message.textContent = 'Такой город уже вводили';
        field.value = '';
    } else if(!compareLetters(city, arr) && !checkCity(city, arr)) {
        message.textContent = `Ошибка! Название города (${field.value}) не с той буквы`;
        field.value = '';
    }
}
